blog/2021-lanqiao-simula.org
#+TITLE:       2021年蓝桥杯模拟赛题解
#+AUTHOR:      shirui
#+EMAIL:       1229408499@qq.com
#+DATE:        2021-01-22 五
#+URI:         /blog/%y/%m/%d/2021-lanqiao-simula
#+KEYWORDS:    蓝桥杯
#+TAGS:        蓝桥杯
#+LANGUAGE:    zh
#+OPTIONS:     H:3 num:nil toc:nil \n:t ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: 2021年蓝桥杯模拟赛题解
* 第一题
** 题目
问题描述
    请问在 1 到 2020 中，有多少个数既是 4 的整数倍，又是 6 的整数倍。
答案提交
　　这是一道结果填空的题，你只需要算出结果后提交即可。本题的结果为一个整数，在提交答案时只填写这个整数，填写多余的内容将无法得分。
** 解析
直接枚举数字然后判断计数即可
** 代码
#+begin_src cpp
#include <iostream>

using namespace std;

int main() {
  int count = 0;
  for (int i = 1; i <= 2020; i++)
    if (i % 4 == 0 && i % 6 == 0)
      count++;
  cout << count << endl;
  return 0;
}
#+end_src

#+RESULTS:
: 168
答案: =168=

* 第二题
** 题目
问题描述
　　小明要用二进制来表示 1 到 10000 的所有整数，要求不同的整数用不同的二进制数表示，请问，为了表示 1 到 10000 的所有整数，至少需要多少个二进制位？
答案提交
　　这是一道结果填空的题，你只需要算出结果后提交即可。本题的结果为一个整数，在提交答案时只填写这个整数，填写多余的内容将无法得分。
** 解析
可以看每种二进制位最高可以表示多大的数，然后选出最小的即可
** 代码
#+begin_src cpp
#include <iostream>

using namespace std;

int main() {
  for (int i = 0, n = 1; n - 1 < 10000; n = n << 1, i++)
    cout << i << ":" << n-1 << endl;
  return 0;
}
#+end_src

#+RESULTS:
|     0:0 |
|     1:1 |
|     2:3 |
|     3:7 |
|    4:15 |
|    5:31 |
|    6:63 |
|   7:127 |
|   8:255 |
|   9:511 |
| 10:1023 |
| 11:2047 |
| 12:4095 |
| 13:8191 |

答案： =14=
* 第三题
** 题目
问题描述
　　请问有多少个序列满足下面的条件：
1. 序列的长度为 5。
2. 序列中的每个数都是 1 到 10 之间的整数。
3. 序列中后面的数大于等于前面的数。
** 解析
直接使用 =dfs= 搜索即可

或者写5个循环也行
** 代码
#+begin_src cpp
#include <iostream>

using namespace std;

int all[5];
long long count = 0;

void dfs(int now) {
  if (now == 5) {
    count++;
    // for (int i = 0; i < 5; i++)
    //   cout << all[i] << " ";
    // cout << endl;
    return;
  }
  for (int i = 1; i <= 10; i++)
    if (now == 0 || i >= all[now - 1]) {
      all[now] = i;
      dfs(now + 1);
    }
}

int main() {
  dfs(0);
  cout << count << endl;
  return 0;
}
#+end_src

#+RESULTS:
: 2002

#+begin_src cpp
#include <iostream>

using namespace std;

int main() {
  int count = 0;
  for (int a = 1; a <= 10; a++)
    for (int b = a; b <= 10; b++)
      for (int c = b; c <= 10; c++)
        for (int d = c; d <= 10; d++)
          for (int e = d; e <= 10; e++)
            count++;
  cout << count << endl;
  return 0;
}
#+end_src

#+RESULTS:
: 2002

答案： =2002=

* 第四题
** 题目
问题描述
　　一个无向图包含 2020 条边，如果图中没有自环和重边，请问最少包含多少个结点？
　　这是一道结果填空的题，你只需要算出结果后提交即可。本题的结果为一个整数，在提交答案时只填写这个整数，填写多余的内容将无法得分。
** 解析
假设有结点的个数为 $n$ 的图，已知边的个数最多为 $\frac{n \times (n-1)}{2}$ ，可以列出等式 $\frac{n \times (n-1)}{2} = 2020$ 可得 $n = 64.0629609128$ 然后取整加一即可
** 答案
=65=
* 第五题
