2021-lanqiao-simula.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://lampze.github.io/rss.xml"
      title="RSS feed for https://lampze.github.io/">
<title>2021年蓝桥杯模拟赛题解</title>
<meta  name="author" content="lampze" />
      <link href= "static/style.css" rel="stylesheet" type="text/css" />
      <link href= "static/org.css" rel="stylesheet" type="text/css" />
      <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
      <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><div class="header">
        <a href="https://lampze.github.io">lampze's Blog</a>
      </div></div>
<div id="content">
<div class="post-date">22 1月 2021</div><h1 class="post-title"><a href="https://lampze.github.io/2021-lanqiao-simula.html">2021年蓝桥杯模拟赛题解</a></h1>
<div id="outline-container-org4de0a76" class="outline-2">
<h2 id="org4de0a76">第一题</h2>
<div class="outline-text-2" id="text-org4de0a76">
</div>
<div id="outline-container-org8e904ff" class="outline-3">
<h3 id="org8e904ff">题目</h3>
<div class="outline-text-3" id="text-org8e904ff">
<p>
问题描述<br>
    请问在 1 到 2020 中，有多少个数既是 4 的整数倍，又是 6 的整数倍。<br>
答案提交<br>
　　这是一道结果填空的题，你只需要算出结果后提交即可。本题的结果为一个整数，在提交答案时只填写这个整数，填写多余的内容将无法得分。<br>
</p>
</div>
</div>
<div id="outline-container-org148b630" class="outline-3">
<h3 id="org148b630">解析</h3>
<div class="outline-text-3" id="text-org148b630">
<p>
直接枚举数字然后判断计数即可<br>
</p>
</div>
</div>
<div id="outline-container-org43bdfef" class="outline-3">
<h3 id="org43bdfef">代码</h3>
<div class="outline-text-3" id="text-org43bdfef">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">count</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>;
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">1</span>; i &lt;= <span style="color: #8a3b3c; font-weight: bold;">2020</span>; i++<span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>i % <span style="color: #8a3b3c; font-weight: bold;">4</span> == <span style="color: #8a3b3c; font-weight: bold;">0</span> &amp;&amp; i % <span style="color: #8a3b3c; font-weight: bold;">6</span> == <span style="color: #8a3b3c; font-weight: bold;">0</span><span style="color: #a626a4;">)</span>
      count++;
  cout &lt;&lt; count &lt;&lt; endl;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>
<p>
答案: <code>168</code><br>
</p>
</div>
</div>
</div>

<div id="outline-container-org72c0d60" class="outline-2">
<h2 id="org72c0d60">第二题</h2>
<div class="outline-text-2" id="text-org72c0d60">
</div>
<div id="outline-container-org891141e" class="outline-3">
<h3 id="org891141e">题目</h3>
<div class="outline-text-3" id="text-org891141e">
<p>
问题描述<br>
　　小明要用二进制来表示 1 到 10000 的所有整数，要求不同的整数用不同的二进制数表示，请问，为了表示 1 到 10000 的所有整数，至少需要多少个二进制位？<br>
答案提交<br>
　　这是一道结果填空的题，你只需要算出结果后提交即可。本题的结果为一个整数，在提交答案时只填写这个整数，填写多余的内容将无法得分。<br>
</p>
</div>
</div>
<div id="outline-container-org565ebe2" class="outline-3">
<h3 id="org565ebe2">解析</h3>
<div class="outline-text-3" id="text-org565ebe2">
<p>
可以看每种二进制位最高可以表示多大的数，然后选出最小的即可<br>
</p>
</div>
</div>
<div id="outline-container-orga6d7165" class="outline-3">
<h3 id="orga6d7165">代码</h3>
<div class="outline-text-3" id="text-orga6d7165">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>, <span style="color: #383a42;">n</span> = <span style="color: #8a3b3c; font-weight: bold;">1</span>; n - <span style="color: #8a3b3c; font-weight: bold;">1</span> &lt; <span style="color: #8a3b3c; font-weight: bold;">10000</span>; n = n &lt;&lt; <span style="color: #8a3b3c; font-weight: bold;">1</span>, i++<span style="color: #a626a4;">)</span>
    cout &lt;&lt; i &lt;&lt; <span style="color: #8a3b3c;">":"</span> &lt;&lt; n-<span style="color: #8a3b3c; font-weight: bold;">1</span> &lt;&lt; endl;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>

<p>
答案： <code>14</code><br>
</p>
</div>
</div>
</div>
<div id="outline-container-org8fe1fbb" class="outline-2">
<h2 id="org8fe1fbb">第三题</h2>
<div class="outline-text-2" id="text-org8fe1fbb">
</div>
<div id="outline-container-org115f38f" class="outline-3">
<h3 id="org115f38f">题目</h3>
<div class="outline-text-3" id="text-org115f38f">
<p>
问题描述<br>
　　请问有多少个序列满足下面的条件：<br>
</p>
<ol class="org-ol">
<li>序列的长度为 5。<br></li>
<li>序列中的每个数都是 1 到 10 之间的整数。<br></li>
<li>序列中后面的数大于等于前面的数。<br></li>
</ol>
</div>
</div>
<div id="outline-container-org511d4a7" class="outline-3">
<h3 id="org511d4a7">解析</h3>
<div class="outline-text-3" id="text-org511d4a7">
<p>
直接使用 <code>dfs</code> 搜索即可<br>
</p>

<p>
或者写5个循环也行<br>
</p>
</div>
</div>
<div id="outline-container-org837971d" class="outline-3">
<h3 id="org837971d">代码</h3>
<div class="outline-text-3" id="text-org837971d">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="font-weight: bold;">int</span> <span style="color: #383a42;">all</span><span style="color: #014980;">[</span><span style="color: #8a3b3c; font-weight: bold;">5</span><span style="color: #014980;">]</span>;
<span style="font-weight: bold;">long</span> <span style="font-weight: bold;">long</span> <span style="color: #383a42;">count</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>;

<span style="font-weight: bold;">void</span> <span style="font-weight: bold;">dfs</span><span style="color: #014980;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">now</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>now == <span style="color: #8a3b3c; font-weight: bold;">5</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    count++;
    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">for (int i = 0; i &lt; 5; i++)</span>
    <span style="color: #556b2f;">//   </span><span style="color: #556b2f;">cout &lt;&lt; all[i] &lt;&lt; " ";</span>
    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">cout &lt;&lt; endl;</span>
    <span style="font-weight: bold;">return</span>;
  <span style="color: #a626a4;">}</span>
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">1</span>; i &lt;= <span style="color: #8a3b3c; font-weight: bold;">10</span>; i++<span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>now == <span style="color: #8a3b3c; font-weight: bold;">0</span> || i &gt;= all<span style="color: #556b2f;">[</span>now - <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #556b2f;">]</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
      all<span style="color: #556b2f;">[</span>now<span style="color: #556b2f;">]</span> = i;
      dfs<span style="color: #556b2f;">(</span>now + <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #556b2f;">)</span>;
    <span style="color: #a626a4;">}</span>
<span style="color: #014980;">}</span>

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  dfs<span style="color: #a626a4;">(</span><span style="color: #8a3b3c; font-weight: bold;">0</span><span style="color: #a626a4;">)</span>;
  cout &lt;&lt; count &lt;&lt; endl;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">count</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>;
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">a</span> = <span style="color: #8a3b3c; font-weight: bold;">1</span>; a &lt;= <span style="color: #8a3b3c; font-weight: bold;">10</span>; a++<span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">b</span> = a; b &lt;= <span style="color: #8a3b3c; font-weight: bold;">10</span>; b++<span style="color: #a626a4;">)</span>
      <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">c</span> = b; c &lt;= <span style="color: #8a3b3c; font-weight: bold;">10</span>; c++<span style="color: #a626a4;">)</span>
        <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">d</span> = c; d &lt;= <span style="color: #8a3b3c; font-weight: bold;">10</span>; d++<span style="color: #a626a4;">)</span>
          <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">e</span> = d; e &lt;= <span style="color: #8a3b3c; font-weight: bold;">10</span>; e++<span style="color: #a626a4;">)</span>
            count++;
  cout &lt;&lt; count &lt;&lt; endl;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>

<p>
答案： <code>2002</code><br>
</p>
</div>
</div>
</div>

<div id="outline-container-org33de61d" class="outline-2">
<h2 id="org33de61d">第四题</h2>
<div class="outline-text-2" id="text-org33de61d">
</div>
<div id="outline-container-orgd70af47" class="outline-3">
<h3 id="orgd70af47">题目</h3>
<div class="outline-text-3" id="text-orgd70af47">
<p>
问题描述<br>
　　一个无向图包含 2020 条边，如果图中没有自环和重边，请问最少包含多少个结点？<br>
　　这是一道结果填空的题，你只需要算出结果后提交即可。本题的结果为一个整数，在提交答案时只填写这个整数，填写多余的内容将无法得分。<br>
</p>
</div>
</div>
<div id="outline-container-orgfc3fa79" class="outline-3">
<h3 id="orgfc3fa79">解析</h3>
<div class="outline-text-3" id="text-orgfc3fa79">
<p>
假设有结点的个数为 \(n\) 的图，已知边的个数最多为 \(\frac{n \times (n-1)}{2}\) ，可以列出等式 \(\frac{n \times (n-1)}{2} = 2020\) 可得 \(n = 64.0629609128\) 然后取整加一即可<br>
</p>
</div>
</div>
