blog/2021-lanqiao-simula.org
** 题目
问题描述
　　两个字母之间的距离定义为它们在字母表中位置的距离。例如 A 和 C 的距离为 2，L 和 Q 的距离为 5。
　　对于一个字符串，我们称字符串中两两字符之间的距离之和为字符串的内部距离。
　　例如：ZOO 的内部距离为 22，其中 Z 和 O 的距离为 11。
　　请问，LANQIAO 的内部距离是多少？
　　这是一道结果填空的题，你只需要算出结果后提交即可。本题的结果为一个整数，在提交答案时只填写这个整数，填写多余的内容将无法得分。
** 解析
枚举 =LANQIAO= 字符串所有两个字符的组合，计算距离然后相加即可
** 代码
#+begin_src cpp
#include <iostream>

using namespace std;

long long f(char a, char b) {
  if (b > a)
    return f(b, a);
  return a - b;
}

int main() {
  string s = "LANQIAO";
  long long sum = 0;
  for (int i = 0; i < s.size(); i++)
    for (int j = i; j < s.size(); j++)
      sum += f(s[i], s[j]);
  cout << sum << endl;
  return 0;
}
#+end_src

#+RESULTS:
: 162

答案： =162=
* 第六题
** 题目
问题描述
　　给定一个平行四边形的底边长度 l 和高度 h，求平行四边形的面积。
输入格式
　　输入的第一行包含一个整数 l，表示平行四边形的底边长度。
　　第二行包含一个整数 h，表示平行四边形的高。
输出格式
　　输出一个整数，表示平行四边形的面积。（提示：底边长度和高都是整数的平行四边形面积为整数）
样例输入
#+begin_example
2
7
#+end_example

样例输出
#+begin_example
14
#+end_example

数据规模和约定：对于所有评测用例，1 <= l, h <= 100。
** 解析
直接计算输出，没什么好说的
** 代码
#+begin_src cpp
#include <iostream>

using namespace std;

int main() {
  int l,h;
  cin >> l >> h;
  cout << l * h << endl;
  return 0;
}
#+end_src

* 第七题
** 题目
问题描述
　　现在时间是 a 点 b 分，请问 t 分钟后，是几点几分？
输入格式
　　输入的第一行包含一个整数 a。
　　第二行包含一个整数 b。
　　第三行包含一个整数 t。
输出格式
　　输出第一行包含一个整数，表示结果是几点。
　　第二行包含一个整数，表示结果是几分。
样例输入

#+begin_example
3
20
165
#+end_example

样例输出

#+begin_example
6
5
#+end_example

样例输入

#+begin_example
3
20
175
#+end_example

样例输出

#+begin_example
6
15
#+end_example

数据规模和约定：对于所有评测用例，0 <= a <= 23, 0 <= b <= 59, 0 <= t, t 分钟后还是在当天。
** 解析
直接把 =t= 加入到 =b= 中，然后把超出的时间补到小时上，并把分钟修整到60分钟内即可。
** 代码
#+begin_src cpp
#include <iostream>

using namespace std;

int main() {
  int a, b, t;
  cin >> a >> b >> t;
  b += t;
  a += b / 60;
  b %= 60;
  cout << a << endl << b << endl;
  return 0;
}
#+end_src
* 第八题
** 题目
问题描述
　　小蓝负责花园的灌溉工作。
　　花园可以看成一个 n 行 m 列的方格图形。中间有一部分位置上安装有出水管。
　　小蓝可以控制一个按钮同时打开所有的出水管，打开时，有出水管的位置可以被认为已经灌溉好。
　　每经过一分钟，水就会向四面扩展一个方格，被扩展到的方格可以被认为已经灌溉好。即如果前一分钟某一个方格被灌溉好，则下一分钟它上下左右的四个方格也被灌溉好。
　　给定花园水管的位置，请问 k 分钟后，有多少个方格被灌溉好？
输入格式
　　输入的第一行包含两个整数 n, m。
　　第二行包含一个整数 t，表示出水管的数量。
　　接下来 t 行描述出水管的位置，其中第 i 行包含两个数 r, c 表示第 r 行第 c 列有一个排水管。
　　接下来一行包含一个整数 k。
输出格式
　　输出一个整数，表示答案。
样例输入

#+begin_example
3 6
2
2 2
3 4
1
#+end_example

样例输出

#+begin_example
9
#+end_example

样例说明
　　用1表示灌溉到，0表示未灌溉到。
　　打开水管时：
　　000000
　　010000
　　000100
　　1分钟后：
　　010000
　　111100
　　011110
　　共有9个方格被灌溉好。
数据规模和约定
　　对于所有评测用例，1 <= n, m <= 100, 1 <= t <= 10, 1 <= k <= 100。
** 解析
使用 =bfs= ，更新每个结点直到时间结束，每次把新灌溉的结点加入到队列即可。
