2021-lanqiao-simula.html
<div id="outline-container-org5b22a6d" class="outline-3">
<h3 id="org5b22a6d">答案</h3>
<div class="outline-text-3" id="text-org5b22a6d">
<p>
<code>65</code><br>
</p>
</div>
</div>
</div>
<div id="outline-container-orgce34020" class="outline-2">
<h2 id="orgce34020">第五题</h2>
<div class="outline-text-2" id="text-orgce34020">
</div>
<div id="outline-container-org2855c5f" class="outline-3">
<h3 id="org2855c5f">题目</h3>
<div class="outline-text-3" id="text-org2855c5f">
<p>
问题描述<br>
　　两个字母之间的距离定义为它们在字母表中位置的距离。例如 A 和 C 的距离为 2，L 和 Q 的距离为 5。<br>
　　对于一个字符串，我们称字符串中两两字符之间的距离之和为字符串的内部距离。<br>
　　例如：ZOO 的内部距离为 22，其中 Z 和 O 的距离为 11。<br>
　　请问，LANQIAO 的内部距离是多少？<br>
　　这是一道结果填空的题，你只需要算出结果后提交即可。本题的结果为一个整数，在提交答案时只填写这个整数，填写多余的内容将无法得分。<br>
</p>
</div>
</div>
<div id="outline-container-orgb8b4aae" class="outline-3">
<h3 id="orgb8b4aae">解析</h3>
<div class="outline-text-3" id="text-orgb8b4aae">
<p>
枚举 <code>LANQIAO</code> 字符串所有两个字符的组合，计算距离然后相加即可<br>
</p>
</div>
</div>
<div id="outline-container-org705094f" class="outline-3">
<h3 id="org705094f">代码</h3>
<div class="outline-text-3" id="text-org705094f">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="font-weight: bold;">long</span> <span style="font-weight: bold;">long</span> <span style="font-weight: bold;">f</span><span style="color: #014980;">(</span><span style="font-weight: bold;">char</span> <span style="color: #383a42;">a</span>, <span style="font-weight: bold;">char</span> <span style="color: #383a42;">b</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>b &gt; a<span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span> f<span style="color: #a626a4;">(</span>b, a<span style="color: #a626a4;">)</span>;
  <span style="font-weight: bold;">return</span> a - b;
<span style="color: #014980;">}</span>

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">string</span> <span style="color: #383a42;">s</span> = <span style="color: #8a3b3c;">"LANQIAO"</span>;
  <span style="font-weight: bold;">long</span> <span style="font-weight: bold;">long</span> <span style="color: #383a42;">sum</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>;
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; s.size<span style="color: #556b2f;">()</span>; i++<span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">j</span> = i; j &lt; s.size<span style="color: #556b2f;">()</span>; j++<span style="color: #a626a4;">)</span>
      sum += f<span style="color: #a626a4;">(</span>s<span style="color: #556b2f;">[</span>i<span style="color: #556b2f;">]</span>, s<span style="color: #556b2f;">[</span>j<span style="color: #556b2f;">]</span><span style="color: #a626a4;">)</span>;
  cout &lt;&lt; sum &lt;&lt; endl;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>

<p>
答案： <code>162</code><br>
</p>
</div>
</div>
</div>
<div id="outline-container-orgc94e9e7" class="outline-2">
<h2 id="orgc94e9e7">第六题</h2>
<div class="outline-text-2" id="text-orgc94e9e7">
</div>
<div id="outline-container-orgb964a51" class="outline-3">
<h3 id="orgb964a51">题目</h3>
<div class="outline-text-3" id="text-orgb964a51">
<p>
问题描述<br>
　　给定一个平行四边形的底边长度 l 和高度 h，求平行四边形的面积。<br>
输入格式<br>
　　输入的第一行包含一个整数 l，表示平行四边形的底边长度。<br>
　　第二行包含一个整数 h，表示平行四边形的高。<br>
输出格式<br>
　　输出一个整数，表示平行四边形的面积。（提示：底边长度和高都是整数的平行四边形面积为整数）<br>
样例输入<br>
</p>
<pre class="example" id="orga6d4214">
2
7
</pre>

<p>
样例输出<br>
</p>
<pre class="example" id="orged9be9f">
14
</pre>

<p>
数据规模和约定：对于所有评测用例，1 &lt;= l, h &lt;= 100。<br>
</p>
</div>
</div>
<div id="outline-container-orgd56a63a" class="outline-3">
<h3 id="orgd56a63a">解析</h3>
<div class="outline-text-3" id="text-orgd56a63a">
<p>
直接计算输出，没什么好说的<br>
</p>
</div>
</div>
<div id="outline-container-org1e7f354" class="outline-3">
<h3 id="org1e7f354">代码</h3>
<div class="outline-text-3" id="text-org1e7f354">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">l</span>,<span style="color: #383a42;">h</span>;
  cin &gt;&gt; l &gt;&gt; h;
  cout &lt;&lt; l * h &lt;&lt; endl;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org36971af" class="outline-2">
<h2 id="org36971af">第七题</h2>
<div class="outline-text-2" id="text-org36971af">
</div>
<div id="outline-container-orgb039718" class="outline-3">
<h3 id="orgb039718">题目</h3>
<div class="outline-text-3" id="text-orgb039718">
<p>
问题描述<br>
　　现在时间是 a 点 b 分，请问 t 分钟后，是几点几分？<br>
输入格式<br>
　　输入的第一行包含一个整数 a。<br>
　　第二行包含一个整数 b。<br>
　　第三行包含一个整数 t。<br>
输出格式<br>
　　输出第一行包含一个整数，表示结果是几点。<br>
　　第二行包含一个整数，表示结果是几分。<br>
样例输入<br>
</p>

<pre class="example" id="org46fb243">
3
20
165
</pre>

<p>
样例输出<br>
</p>

<pre class="example" id="orgb1ce5b9">
6
5
</pre>

<p>
样例输入<br>
</p>

<pre class="example" id="orgdd8ea9c">
3
20
175
</pre>

<p>
样例输出<br>
</p>

<pre class="example" id="org7e46c4b">
6
15
</pre>

<p>
数据规模和约定：对于所有评测用例，0 &lt;= a &lt;= 23, 0 &lt;= b &lt;= 59, 0 &lt;= t, t 分钟后还是在当天。<br>
</p>
</div>
</div>
<div id="outline-container-org58b3dcc" class="outline-3">
<h3 id="org58b3dcc">解析</h3>
<div class="outline-text-3" id="text-org58b3dcc">
<p>
直接把 <code>t</code> 加入到 <code>b</code> 中，然后把超出的时间补到小时上，并把分钟修整到60分钟内即可。<br>
</p>
</div>
</div>
<div id="outline-container-org8a61a38" class="outline-3">
<h3 id="org8a61a38">代码</h3>
<div class="outline-text-3" id="text-org8a61a38">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">a</span>, <span style="color: #383a42;">b</span>, <span style="color: #383a42;">t</span>;
  cin &gt;&gt; a &gt;&gt; b &gt;&gt; t;
  b += t;
  a += b / <span style="color: #8a3b3c; font-weight: bold;">60</span>;
  b %= <span style="color: #8a3b3c; font-weight: bold;">60</span>;
  cout &lt;&lt; a &lt;&lt; endl &lt;&lt; b &lt;&lt; endl;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7c2d16e" class="outline-2">
<h2 id="org7c2d16e">第八题</h2>
<div class="outline-text-2" id="text-org7c2d16e">
</div>
<div id="outline-container-orgf7dbc3b" class="outline-3">
<h3 id="orgf7dbc3b">题目</h3>
<div class="outline-text-3" id="text-orgf7dbc3b">
<p>
问题描述<br>
　　小蓝负责花园的灌溉工作。<br>
　　花园可以看成一个 n 行 m 列的方格图形。中间有一部分位置上安装有出水管。<br>
　　小蓝可以控制一个按钮同时打开所有的出水管，打开时，有出水管的位置可以被认为已经灌溉好。<br>
　　每经过一分钟，水就会向四面扩展一个方格，被扩展到的方格可以被认为已经灌溉好。即如果前一分钟某一个方格被灌溉好，则下一分钟它上下左右的四个方格也被灌溉好。<br>
　　给定花园水管的位置，请问 k 分钟后，有多少个方格被灌溉好？<br>
输入格式<br>
　　输入的第一行包含两个整数 n, m。<br>
　　第二行包含一个整数 t，表示出水管的数量。<br>
　　接下来 t 行描述出水管的位置，其中第 i 行包含两个数 r, c 表示第 r 行第 c 列有一个排水管。<br>
　　接下来一行包含一个整数 k。<br>
输出格式<br>
　　输出一个整数，表示答案。<br>
样例输入<br>
</p>

<pre class="example" id="org2a7caf0">
3 6
2
2 2
3 4
1
</pre>

<p>
样例输出<br>
</p>

<pre class="example" id="org079afbb">
9
</pre>

<p>
样例说明<br>
　　用1表示灌溉到，0表示未灌溉到。<br>
　　打开水管时：<br>
　　000000<br>
　　010000<br>
　　000100<br>
　　1分钟后：<br>
　　010000<br>
　　111100<br>
　　011110<br>
　　共有9个方格被灌溉好。<br>
数据规模和约定<br>
　　对于所有评测用例，1 &lt;= n, m &lt;= 100, 1 &lt;= t &lt;= 10, 1 &lt;= k &lt;= 100。<br>
</p>
</div>
</div>
<div id="outline-container-orgf9e4e77" class="outline-3">
<h3 id="orgf9e4e77">解析</h3>
<div class="outline-text-3" id="text-orgf9e4e77">
<p>
使用 <code>bfs</code> ，更新每个结点直到时间结束，每次把新灌溉的结点加入到队列即可。<br>
</p>
</div>
</div>
