blog/2021-lanqiao-simula.org
** 代码
#+begin_src cpp
#include <iostream>
#include <queue>

using namespace std;

// 保存状态
struct point {
  int x, y, time;
  point(int _x, int _y, int _time) {
    x = _x;
    y = _y;
    time = _time;
  }
};
// all是全部的花园
bool all[105][105];
// 下一步的数组
int nex[4][2] = {-1, 0, 1, 0, 0, -1, 0, 1};

int main() {
  int n, m, t;
  cin >> n >> m >> t;
  queue<point> q;
  // 处理水管，标记好花园，并加入到队列
  for (int i = 0; i < t; i++) {
    int r, c;
    cin >> r >> c;
    q.push(point(r, c, 0));
    all[r][c] = true;
  }
  int k, count;
  cin >> k;
  count = t;
  while (!q.empty()) {
    point a = q.front();
    q.pop();
    // 如果时间到了就不进行下一步了
    if (a.time == k)
      continue;
    // 遍历四周
    for (int i = 0; i < 4; i++) {
      int x = a.x + nex[i][0], y = a.y + nex[i][1];
      // 如果这个格子没有水，就加入队列并标记
      if (x > 0 && y > 0 && x <= n && y <= m && !all[x][y]) {
        all[x][y] = true;
        q.push(point(x, y, a.time + 1));
        count++;
      }
    }
  }
  cout << count << endl;
  return 0;
}
#+end_src
* 第九题
** 题目
问题描述
　　小蓝有一张黑白图像，由 n * m 个像素组成，其中从上到下共 n 行，每行从左到右 m 列。每个像素由一个 0 到 255 之间的灰度值表示。
　　现在，小蓝准备对图像进行模糊操作，操作的方法为：
　　对于每个像素，将以它为中心 3 * 3 区域内的所有像素（可能是 9 个像素或少于 9 个像素）求和后除以这个范围内的像素个数（取下整），得到的值就是模糊后的结果。
　　请注意每个像素都要用原图中的灰度值计算求和。
输入格式
　　输入的第一行包含两个整数 n, m。
　　第 2 行到第 n + 1 行每行包含 m 个整数，表示每个像素的灰度值，相邻整数之间用一个空格分隔。
输出格式
　　输出 n 行，每行 m 个整数，相邻整数之间用空格分隔，表示模糊后的图像。
样例输入

#+begin_example
3 4
0 0 0 255
0 0 255 0
0 30 255 255
#+end_example

样例输出

#+begin_example
0 42 85 127
5 60 116 170
7 90 132 191
#+end_example

数据规模和约定
　　对于所有评测用例，1 <= n, m <= 100。
** 解析
遍历统计计算并输出即可
** 代码
#+begin_src cpp
#include <iostream>

using namespace std;

int main() {
  int n, m;
  cin >> n >> m;
  int pic[n][m];
  for (int i = 0; i < n; i++)
    for (int j = 0; j < m; j++)
      cin >> pic[i][j];
  for (int i = 0; i < n; i++) {
    for (int j = 0; j < m; j++) {
      int c = 0, sum = 0;
      // 遍历周边像素，计算和与个数
      for (int a = -1; a <= 1; a++)
        for (int b = -1; b <= 1; b++) {
          int x = i + a, y = j + b;
          if (x >= 0 && y >= 0 && x < n && y < m)
            c++, sum += pic[x][y];
        }
      // 计算并直接输出
      cout << sum / c << " ";
    }
    cout << endl;
  }
  return 0;
}
#+end_src
* 第十题
