2021-lanqiao-simula.html
<div id="outline-container-org33c7ab0" class="outline-3">
<h3 id="org33c7ab0">代码</h3>
<div class="outline-text-3" id="text-org33c7ab0">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">iostream</span><span style="color: #014980;">&gt;</span>
<span style="color: #383a42; font-weight: bold;">#include</span> <span style="color: #014980;">&lt;</span><span style="color: #8a3b3c;">queue</span><span style="color: #014980;">&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="color: #383a42;">std</span>;

<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#20445;&#23384;&#29366;&#24577;</span>
<span style="font-weight: bold;">struct</span> <span style="font-weight: bold;">point</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">x</span>, <span style="color: #383a42;">y</span>, <span style="color: #383a42;">time</span>;
  <span style="font-weight: bold;">point</span><span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">_x</span>, <span style="font-weight: bold;">int</span> <span style="color: #383a42;">_y</span>, <span style="font-weight: bold;">int</span> <span style="color: #383a42;">_time</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    x = _x;
    y = _y;
    time = _time;
  <span style="color: #a626a4;">}</span>
<span style="color: #014980;">}</span>;
<span style="color: #556b2f;">// </span><span style="color: #556b2f;">all&#26159;&#20840;&#37096;&#30340;&#33457;&#22253;</span>
<span style="font-weight: bold;">bool</span> <span style="color: #383a42;">all</span><span style="color: #014980;">[</span><span style="color: #8a3b3c; font-weight: bold;">105</span><span style="color: #014980;">][</span><span style="color: #8a3b3c; font-weight: bold;">105</span><span style="color: #014980;">]</span>;
<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#19979;&#19968;&#27493;&#30340;&#25968;&#32452;</span>
<span style="font-weight: bold;">int</span> <span style="color: #383a42;">nex</span><span style="color: #014980;">[</span><span style="color: #8a3b3c; font-weight: bold;">4</span><span style="color: #014980;">][</span><span style="color: #8a3b3c; font-weight: bold;">2</span><span style="color: #014980;">]</span> = <span style="color: #014980;">{</span>-<span style="color: #8a3b3c; font-weight: bold;">1</span>, <span style="color: #8a3b3c; font-weight: bold;">0</span>, <span style="color: #8a3b3c; font-weight: bold;">1</span>, <span style="color: #8a3b3c; font-weight: bold;">0</span>, <span style="color: #8a3b3c; font-weight: bold;">0</span>, -<span style="color: #8a3b3c; font-weight: bold;">1</span>, <span style="color: #8a3b3c; font-weight: bold;">0</span>, <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #014980;">}</span>;

<span style="font-weight: bold;">int</span> <span style="font-weight: bold;">main</span><span style="color: #014980;">()</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">n</span>, <span style="color: #383a42;">m</span>, <span style="color: #383a42;">t</span>;
  cin &gt;&gt; n &gt;&gt; m &gt;&gt; t;
  <span style="font-weight: bold;">queue</span><span style="color: #a626a4;">&lt;</span><span style="font-weight: bold;">point</span><span style="color: #a626a4;">&gt;</span> <span style="color: #383a42;">q</span>;
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#22788;&#29702;&#27700;&#31649;&#65292;&#26631;&#35760;&#22909;&#33457;&#22253;&#65292;&#24182;&#21152;&#20837;&#21040;&#38431;&#21015;</span>
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; t; i++<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="font-weight: bold;">int</span> <span style="color: #383a42;">r</span>, <span style="color: #383a42;">c</span>;
    cin &gt;&gt; r &gt;&gt; c;
    q.push<span style="color: #556b2f;">(</span>point<span style="color: #014980;">(</span>r, c, <span style="color: #8a3b3c; font-weight: bold;">0</span><span style="color: #014980;">)</span><span style="color: #556b2f;">)</span>;
    all<span style="color: #556b2f;">[</span>r<span style="color: #556b2f;">][</span>c<span style="color: #556b2f;">]</span> = <span style="color: #383a42;">true</span>;
  <span style="color: #a626a4;">}</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">k</span>, <span style="color: #383a42;">count</span>;
  cin &gt;&gt; k;
  count = t;
  <span style="font-weight: bold;">while</span> <span style="color: #a626a4;">(</span><span style="color: #383a42; font-weight: bold;">!</span>q.empty<span style="color: #556b2f;">()</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="font-weight: bold;">point</span> <span style="color: #383a42;">a</span> = q.front<span style="color: #556b2f;">()</span>;
    q.pop<span style="color: #556b2f;">()</span>;
    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#22914;&#26524;&#26102;&#38388;&#21040;&#20102;&#23601;&#19981;&#36827;&#34892;&#19979;&#19968;&#27493;&#20102;</span>
    <span style="font-weight: bold;">if</span> <span style="color: #556b2f;">(</span>a.time == k<span style="color: #556b2f;">)</span>
      <span style="font-weight: bold;">continue</span>;
    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36941;&#21382;&#22235;&#21608;</span>
    <span style="font-weight: bold;">for</span> <span style="color: #556b2f;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; <span style="color: #8a3b3c; font-weight: bold;">4</span>; i++<span style="color: #556b2f;">)</span> <span style="color: #556b2f;">{</span>
      <span style="font-weight: bold;">int</span> <span style="color: #383a42;">x</span> = a.x + nex<span style="color: #014980;">[</span>i<span style="color: #014980;">][</span><span style="color: #8a3b3c; font-weight: bold;">0</span><span style="color: #014980;">]</span>, <span style="color: #383a42;">y</span> = a.y + nex<span style="color: #014980;">[</span>i<span style="color: #014980;">][</span><span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #014980;">]</span>;
      <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#22914;&#26524;&#36825;&#20010;&#26684;&#23376;&#27809;&#26377;&#27700;&#65292;&#23601;&#21152;&#20837;&#38431;&#21015;&#24182;&#26631;&#35760;</span>
      <span style="font-weight: bold;">if</span> <span style="color: #014980;">(</span>x &gt; <span style="color: #8a3b3c; font-weight: bold;">0</span> &amp;&amp; y &gt; <span style="color: #8a3b3c; font-weight: bold;">0</span> &amp;&amp; x &lt;= n &amp;&amp; y &lt;= m &amp;&amp; <span style="color: #383a42; font-weight: bold;">!</span>all<span style="color: #a626a4;">[</span>x<span style="color: #a626a4;">][</span>y<span style="color: #a626a4;">]</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
        all<span style="color: #a626a4;">[</span>x<span style="color: #a626a4;">][</span>y<span style="color: #a626a4;">]</span> = <span style="color: #383a42;">true</span>;
        q.push<span style="color: #a626a4;">(</span>point<span style="color: #556b2f;">(</span>x, y, a.time + <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #556b2f;">)</span><span style="color: #a626a4;">)</span>;
        count++;
      <span style="color: #014980;">}</span>
    <span style="color: #556b2f;">}</span>
  <span style="color: #a626a4;">}</span>
  cout &lt;&lt; count &lt;&lt; endl;
  <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org93c8cf9" class="outline-2">
<h2 id="org93c8cf9">第九题</h2>
<div class="outline-text-2" id="text-org93c8cf9">
</div>
<div id="outline-container-org9b71fdd" class="outline-3">
<h3 id="org9b71fdd">题目</h3>
<div class="outline-text-3" id="text-org9b71fdd">
<p>
问题描述<br>
　　小蓝有一张黑白图像，由 n * m 个像素组成，其中从上到下共 n 行，每行从左到右 m 列。每个像素由一个 0 到 255 之间的灰度值表示。<br>
　　现在，小蓝准备对图像进行模糊操作，操作的方法为：<br>
　　对于每个像素，将以它为中心 3 * 3 区域内的所有像素（可能是 9 个像素或少于 9 个像素）求和后除以这个范围内的像素个数（取下整），得到的值就是模糊后的结果。<br>
　　请注意每个像素都要用原图中的灰度值计算求和。<br>
输入格式<br>
　　输入的第一行包含两个整数 n, m。<br>
　　第 2 行到第 n + 1 行每行包含 m 个整数，表示每个像素的灰度值，相邻整数之间用一个空格分隔。<br>
输出格式<br>
　　输出 n 行，每行 m 个整数，相邻整数之间用空格分隔，表示模糊后的图像。<br>
样例输入<br>
</p>

<pre class="example" id="org650d838">
3 4
0 0 0 255
0 0 255 0
0 30 255 255
</pre>

<p>
样例输出<br>
</p>

<pre class="example" id="org382d2eb">
0 42 85 127
5 60 116 170
7 90 132 191
</pre>

<p>
数据规模和约定<br>
　　对于所有评测用例，1 &lt;= n, m &lt;= 100。<br>
</p>
</div>
</div>
